<?php
/**
 * 状态配置文件
 * _d代表文字描述
 */

//招聘标签-薪酬
$job_mark_salary = array (
		1 => '固定工资',
		2 => '绩效奖金',
		3 => '项目奖金',
		4 => '包吃',
		5 => '包住',
		6 => '全勤奖',
		7 => '年终奖',
		8 => '退休金计划',
);
define('job_mark_salary', json_encode($job_mark_salary));

//招聘标签-保障
$job_mark_insurance = array (
		1 => '社保',
		2 => '住房公积金',
		3 => '商业保险',
		4 => '毕业生落户',
		5 => '岗位晋升',
		6 => '定期体检',
);
define('job_mark_insurance', json_encode($job_mark_insurance));

//招聘标签-假期
$job_mark_holiday = array (
		1 => '弹性工作',
		2 => '周末双休',
		3 => '周末单休',
		4 => '周末单/双休',
		5 => '法定节假日',
		6 => '带薪年假',
		7 => '婚假',
		8 => '产检假',
		9 => '产假',
		10 => '哺乳假',
		11 => '带薪病假',
		12 => '考试假',
		13 => '慰唁假',
);
define('job_mark_holiday', json_encode($job_mark_holiday));

//招聘标签-补贴活动
$job_mark_subsidy = array (
		1 => '节日福利',
		2 => '餐补',
		3 => '通讯补贴',
		4 => '公交补贴',
		5 => '出差补贴',
		6 => '租房补贴',
		7 => '汽油补贴',
		8 => '部门活动',
		9 => '节日活动',
		10 => '公费旅游',
		11 => '拓展',
		12 => '培训提升',
		13 => '结婚礼金',
		14 => '生育礼金',
);
define('job_mark_subsidy', json_encode($job_mark_subsidy));

//快递公司
$logistics = array (
    1 => '自己物流',
    2 => '顺丰速运',
    3 => '圆通速递',
    4 => '中通快递',
    5 => '申通快递',
    6 => '韵达速递',
    7 => 'EMS',
    8 => '天天快递',
    9 => '优速快递',
    10 => '百世快递',
    11 => '安能物流',
    12 => '宅急送',
    13 => '快捷快递',
    14 => '邮政包裹',
    15 => '德邦',
    16 => '汇通快递',
    17 => '速尔快递',
	18 => '国通快递',
	19 => '邮政快递包裹',
	20 => '京东快递',
	21 => '德邦快递',
	22 => '安捷快递',
	23 => 'EMS国内',
	24 => '丰巢',
	25 => '京东快运',
	26 => '韵达快运',
	27 => '中邮快递',
    28 => '芝麻开门',
);
define('logistics', json_encode($logistics));

//账号类型
$account_type = array (
		'ALI' => 1,     // 支付宝
		/* 'WX' => 2,      // 微信
		'BOC' => 3,     // 中国银行
		'ABC' => 4,     // 中国农业银行
		'ICBC' => 5,    // 中国工商银行
		'CCB' => 6,     // 中国建设银行
		'CMBC' => 7,    // 中国民生银行
		'CMB' => 8,     // 招商银行
		'CIB' => 9,     // 兴业银行
		'BOB' => 10,    // 北京银行
		'BCM' => 11,    // 交通银行
		'CEB' => 12,    // 中国光大银行
		'GDB' => 13,    // 广东发展银行
		'SPDB' => 14,   // 上海浦东发展银行
		'HSBC' => 15,   // 汇丰银行
		'HXB' => 16,    // 华夏银行
		'CITIC' => 17,  // 中信银行 */
);
define('account_type', json_encode($account_type));
$account_type_d = array (
		1 => '支付宝',
		/* 2 => '微信',
		3 => '中国银行',
		4 => '中国农业银行',
		5 => '中国工商银行',
		6 => '中国建设银行',
		7 => '中国民生银行',
		8 => '招商银行',
		9 => '兴业银行',
		10 => '北京银行',
		11 => '交通银行',
		12 => '中国光大银行',
		13 => '广东发展银行',
		14 => '上海浦东发展银行',
		15 => '汇丰银行',
		16 => '华夏银行',
		17 => '中信银行' */
);
define('account_type_d', json_encode($account_type_d));

//淘宝推广位ID-10个
/*
$tb_pid = array (
		1 => 'mm_124618361_32662933_109570650458',
		2 => 'mm_124618361_32662933_109571750407',
		3 => 'mm_124618361_32662933_109573750183',
		4 => 'mm_124618361_32662933_109574400121',
		5 => 'mm_124618361_32662933_109570850439',
		6 => 'mm_124618361_32662933_109571650431',
		7 => 'mm_124618361_32662933_109573500192',
		8 => 'mm_124618361_32662933_109570450499',
		9 => 'mm_124618361_32662933_109573100187',
		10 =>'mm_124618361_32662933_109573350205',
);
define('tb_pid', json_encode($tb_pid));
*/